The number of currently connected properties.
  Namespace:   Autodesk.Revit.Utility
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public int NumberOfConnectedProperties { get; }
  Visual Basic
Public ReadOnly Property NumberOfConnectedProperties As Integer
	Get
  Visual C++
public:
property int NumberOfConnectedProperties {
	int get ();
}
 See Also
  AssetProperty Class
  Autodesk.Revit.Utility Namespace